devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
static const uint16_t ep_tx_status_reg[] = {
        [USB_EP_STATUS__DISABLED] = 0,
        [USB_EP_STATUS__STALL   ] = (USB_EP0R_STAT_TX_0),
        [USB_EP_STATUS__NAK     ] = (USB_EP0R_STAT_TX_1),
        [USB_EP_STATUS__VALID   ] = (USB_EP0R_STAT_TX_1 | USB_EP0R_STAT_TX_0)
};

static const uint16_t ep_rx_status_reg[] = {
        [USB_EP_STATUS__DISABLED] = 0,
        [USB_EP_STATUS__STALL   ] = (USB_EP0R_STAT_RX_0),
        [USB_EP_STATUS__NAK     ] = (USB_EP0R_STAT_RX_1),
        [USB_EP_STATUS__VALID   ] = (USB_EP0R_STAT_RX_1 | USB_EP0R_STAT_RX_0)
};

static const uint16_t transfer_type_reg[] = {
        [USB_TRANSFER__BULK       ] = 0,
        [USB_TRANSFER__CONTROL    ] = (USB_EP0R_EP_TYPE_0),
        [USB_TRANSFER__ISOCHRONOUS] = (USB_EP0R_EP_TYPE_1),
        [USB_TRANSFER__INTERRUPT  ] = (USB_EP0R_EP_TYPE_1 | USB_EP0R_EP_TYPE_0)
};

static const u32_t ep0_status_stage_timeout_ms          = 5;
static const u32_t ep0_data_stage_transmit_timeout_ms   = 2000;
static const u32_t ep0_data_stage_receive_timeout_ms    = MAX_DELAY_MS;
static const u32_t ep1_7_data_stage_transmit_timeout_ms = 4500;

/* GPIO peripherals */
static const GPIO_t *GPIOx[] = {
        #if defined(RCC_APB2ENR_IOPAEN)
                GPIOA,
        #endif
        #if defined(RCC_APB2ENR_IOPBEN)
                GPIOB,
        #endif
        #if defined(RCC_APB2ENR_IOPCEN)
                GPIOC,
        #endif
        #if defined(RCC_APB2ENR_IOPDEN)
                GPIOD,
        #endif
        #if defined(RCC_APB2ENR_IOPEEN)
                GPIOE,
        #endif
        #if defined(RCC_APB2ENR_IOPFEN)
                GPIOF,
        #endif
        #if defined(RCC_APB2ENR_IOPGEN)
                GPIOG,
        #endif
};

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  External objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(USBD, void **device_handle, u8_t major, u8_t minor)
{
        int result = ENODEV;

        if (major == _USBD_MAJOR_NUMBER && minor <= _USBD_MINOR_NUMBER_EP_7) {

                /* allocate main USB memory */
                if (usb_mem == NULL) {
                        if (!(RCC->APB1ENR & RCC_APB1ENR_CAN1EN)) {
                                result = sys_zalloc(sizeof(USB_mem_t), device_handle);
                                if (result == ESUCC) {
                                        /* enable USB clock */
                                        SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                                        CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                                        SET_BIT(RCC->APB1ENR, RCC_APB1ENR_USBEN);

                                        /* enable USB interrupts in NVIC */
                                        NVIC_SetPriority(USB_LP_CAN1_RX0_IRQn, _USBD_IRQ_PRIORITY);
                                        NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);

                                        /* set allocated memory */
                                        USB_mem_t *hdl = *device_handle;
                                        usb_mem        = hdl;
                                        hdl->activated = false;
                                        hdl->major     = major;
                                }
                        } else {
                                return EADDRINUSE;
                        }
                }

                /* allocate Endpoint memory */
                if (usb_mem != NULL) {
                        result = sys_zalloc(sizeof(USB_ep_t), device_handle);
                        if (result == ESUCC) {
                                USB_ep_t *ep_hdl = *device_handle;

                                if (minor == USB_EP_NUM__ENDP0) {
                                        result = sys_semaphore_create(1, 0, &ep_hdl->setup);
                                        if (result != ESUCC)
                                                goto finish;

                                        sys_semaphore_wait(ep_hdl->setup, 0);
                                }

                                result = sys_semaphore_create(1, 0, &ep_hdl->rx);
                                if (result != ESUCC)
                                        goto finish;

                                result = sys_semaphore_create(1, 0, &ep_hdl->tx);
                                if (result != ESUCC)
                                        goto finish;

                                ep_hdl->minor      = minor;
                                usb_mem->ep[minor] = ep_hdl;

                                finish:
                                if (result != ESUCC) {
                                        if (ep_hdl->rx) {
                                                sys_semaphore_delete(ep_hdl->rx);
                                        }

                                        if (ep_hdl->tx) {
                                                sys_semaphore_delete(ep_hdl->tx);
                                        }

                                        if (ep_hdl->setup) {
                                                sys_semaphore_delete(ep_hdl->setup);
                                        }

                                        if (ep_hdl) {
                                                sys_free(device_handle);
                                        }
                                }
                        }
                }
        }

        return result;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(USBD, void *device_handle)
{
        if (usb_mem->activated == false) {
                USB_ep_t *ep_hdl = device_handle;

                disable_endpoint(ep_hdl->minor);

                sys_semaphore_destroy(ep_hdl->rx);
                ep_hdl->rx = NULL;

                sys_semaphore_destroy(ep_hdl->tx);
                ep_hdl->tx = NULL;

                if (ep_hdl->setup) {
                        sys_semaphore_destroy(ep_hdl->setup);
                        ep_hdl->setup = NULL;
                }

                usb_mem->ep[ep_hdl->minor] = NULL;
                sys_free(device_handle);

                /* find if all endpoints are disabled */
                for (int i = _USBD_MINOR_NUMBER_EP_0; i <= _USBD_MINOR_NUMBER_EP_7; i++) {
                        if (usb_mem->ep[i] != NULL) {
                                return ESUCC;
                        }
                }

                /* deinitializes enitre module because all endpoints are disabled */
                /* disable USB IRQs */
                NVIC_DisableIRQ(USB_LP_CAN1_RX0_IRQn);

