devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
        case IOCTL_USBD__SET_ERROR_STATUS:
                if (usb_mem->activated) {
                        set_ep_rx_status(hdl->minor, USB_EP_STATUS__STALL);
                        set_ep_tx_status(hdl->minor, USB_EP_STATUS__STALL);
                        status = ESUCC;
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__GET_SETUP_PACKET:
                if (usb_mem->activated && hdl->minor == USB_EP_NUM__ENDP0) {
                        if (arg) {
                                set_setup_in_progress(hdl->minor, true);

                                usbd_setup_container_t *setup = arg;
                                if (sys_semaphore_wait(hdl->setup, setup->timeout) == ESUCC) {

                                        if (hdl->setup_in_progress == true) {
                                                set_setup_in_progress(hdl->minor, false);

                                                low_level_pma_read(USB_PMA->EP[hdl->minor].SBF.ADDR_RX,
                                                                   (u8_t*)&setup->packet,
                                                                   sizeof(usb_setup_packet_t));

                                                status = ESUCC;
                                        } else {
                                                status = ECANCELED;
                                        }
                                } else {
                                        set_setup_in_progress(hdl->minor, false);
                                        status = ETIME;
                                }
                        } else {
                                status = EINVAL;
                        }
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__GET_ERROR_COUNTER:
                if (arg) {
                        sys_critical_section_begin();
                        *cast(int*, arg) = usb_mem->error_cnt;
                        usb_mem->error_cnt = 0;
                        sys_critical_section_end();
                        status = ESUCC;
                } else {
                        status = EINVAL;
                }
                break;

        default:
                status = EBADRQC;
                break;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(USBD, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(USBD, void *device_handle, struct vfs_dev_stat *device_stat)
{
        USB_ep_t *hdl = device_handle;

        if (usb_mem->ep_config) {
                size_t size = 0;
                if (usb_mem->ep_config->ep[hdl->minor].OUT_enabled)
                        size = get_ep_received_size(hdl->minor);

                if (usb_mem->ep_config->ep[hdl->minor].IN_enabled)
                        size = usb_mem->ep_config->ep[hdl->minor].IN_buffer_size;

                device_stat->st_size  = size;
                device_stat->st_major = _USBD_MAJOR_NUMBER;
                device_stat->st_minor = hdl->minor;

                return ESUCC;
        } else {
                return EINVAL;
        }
}

//==============================================================================
/**
 * @brief Function enables the USB D+ pullup to make device visible by the host
 */
//==============================================================================
static inline void enable_usb_visible_pullup()
{
        if (  (_USBD_CONFIG_PULLUP_PORT_IDX < ARRAY_SIZE(GPIOx))
           && (_USBD_CONFIG__PULLUP_PIN_IDX < 16)) {
                GPIO_t *GPIO = const_cast(GPIO_t*, GPIOx[_USBD_CONFIG_PULLUP_PORT_IDX]);
                GPIO->BSRR   = (1 << (_USBD_CONFIG__PULLUP_PIN_IDX));
        }
}

//==============================================================================
/**
 * @brief Function disables the USB D+ pullup to make device not visible by the host
 */
//==============================================================================
static inline void disable_usb_visible_pullup()
{
        if (  _USBD_CONFIG_PULLUP_PORT_IDX < ARRAY_SIZE(GPIOx)
           && _USBD_CONFIG__PULLUP_PIN_IDX < 16) {
                GPIO_t *GPIO = const_cast(GPIO_t*, GPIOx[_USBD_CONFIG_PULLUP_PORT_IDX]);
                GPIO->BRR    = (1 << (_USBD_CONFIG__PULLUP_PIN_IDX));
        }
}

//==============================================================================
/**
 * @brief Function sets a Tx (IN) status of selected endpoint
 *
 * @param ep            endpoint number
 * @param status        status to set
 */
//==============================================================================
static void set_ep_tx_status(usb_ep_num_t ep, usb_ep_status_t status)
{
        sys_critical_section_begin();
        USB->EPxR[ep] = ((USB->EPxR[ep] & (USB_EPR_EP_TYPE | USB_EPR_EP_KIND | USB_EPR_EA | USB_EPR_STAT_TX))
                         | USB_EPR_CTR_RX | USB_EPR_CTR_TX) ^ ep_tx_status_reg[status];
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function sets a Rx (OUT) status of selected endpoint
 *
 * @param ep            endpoint number
 * @param status        status to set
 */
//==============================================================================
static void set_ep_rx_status(usb_ep_num_t ep, usb_ep_status_t status)
{
        sys_critical_section_begin();
        USB->EPxR[ep] = ((USB->EPxR[ep] & (USB_EPR_EP_TYPE | USB_EPR_EP_KIND | USB_EPR_EA | USB_EPR_STAT_RX))
                         | USB_EPR_CTR_RX | USB_EPR_CTR_TX) ^ ep_rx_status_reg[status];
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Disables selected endpoint
 *
 * @param ep            endpoint number
 */
//==============================================================================
static void disable_endpoint(usb_ep_num_t ep)
{
        USB_PMA->EP[ep].SBF.ADDR_TX  = 0;
        USB_PMA->EP[ep].SBF.ADDR_RX  = 0;
        USB_PMA->EP[ep].SBF.COUNT_TX = 0;
        USB_PMA->EP[ep].SBF.COUNT_RX = 0;
        USB->EPxR[ep] = USB->EPxR[ep] | USB_EP0R_CTR_RX | USB_EP0R_CTR_TX;
        USB->EPxR[ep] = 0;
}

//==============================================================================
/**
 * @brief Check and convert endpoint size to BTABLE register value
 *
 * @param size          size to convert
 *
 * @return On success, returns a value converted to BTABLE format. On error,
 *         returns the UINT16_MAX value.
 */
//==============================================================================
static u16_t endpoint_size_to_register(u16_t size)
{
        if (size <= 62 && size % 2 == 0)
                return (size / 2) << 10;
        else if (size >= 32 && size <= 256 && size % 32 == 0) {
                return USB_COUNT0_RX_BLSIZE | (((size / 32) - 1) << 10);
        } else {
                return UINT16_MAX;
        }
}

//==============================================================================
/**
 * @brief This function enables endpoint 0 for control purposes and disables all
 *        other endpoints.
 */
//==============================================================================
static void configure_endpoint_0()
{
        /* Endpoint 0 configuration - exist only 1 configuration */
        if (  _USBD_ENDPOINT0_SIZE == 8  || _USBD_ENDPOINT0_SIZE == 16
           || _USBD_ENDPOINT0_SIZE == 32 || _USBD_ENDPOINT0_SIZE == 64) {

